import React from 'react'
import './index.css'
import Button from '../button'
import Logo from '../img/logo.svg'

export default function index() {
    return (
        <div className='footer-wrapper'>
            <div className="container">
                <div className='footer'>
                    <div className='footer-title'>
                        <h1>Контакты</h1>
                        <div className='footer-cotact'>
                            <div className='footer-localtion'>
                                <div className='footer-location-icon icon'>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                                        <path d="M12.5 0C7.50757 0 3.44595 4.06162 3.44595 9.054C3.44595 15.2497 11.5484 24.3454 11.8934 24.7295C12.2174 25.0904 12.7832 25.0898 13.1066 24.7295C13.4516 24.3454 21.554 15.2497 21.554 9.054C21.554 4.06162 17.4924 0 12.5 0ZM12.5 13.6093C9.98818 13.6093 7.94472 11.5658 7.94472 9.054C7.94472 6.54219 9.98823 4.49873 12.5 4.49873C15.0118 4.49873 17.0552 6.54224 17.0552 9.05405C17.0552 11.5659 15.0118 13.6093 12.5 13.6093Z" fill="#0D4C93" />
                                    </svg>
                                </div>
                                <div className='footer-location-text'>
                                    <p>г.Ташкент, Чиланзар <br />10 квартал, дом 3/1</p>
                                </div>
                            </div>
                            <div className='footer-conatct'>
                                <div className='footer-contact-icon icon'>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="22" height="22" viewBox="0 0 22 22" fill="none">
                                        <g clip-path="url(#clip0_502_301)">
                                            <path d="M9.1099 12.89C7.01004 10.7902 6.5359 8.69031 6.42894 7.849C6.39905 7.61637 6.4791 7.38309 6.64552 7.21782L8.34483 5.51927C8.5948 5.26946 8.63916 4.88013 8.4518 4.58048L5.74618 0.379239C5.53889 0.0474371 5.11327 -0.0723136 4.76338 0.102722L0.419903 2.14834C0.136959 2.28767 -0.0294639 2.58829 0.00266119 2.90203C0.230247 5.0641 1.17283 10.379 6.39594 15.6025C11.619 20.826 16.9332 21.7682 19.0964 21.9958C19.4101 22.0279 19.7107 21.8615 19.8501 21.5785L21.8957 17.235C22.0701 16.8859 21.9511 16.4614 21.6207 16.2538L17.4195 13.5489C17.12 13.3613 16.7307 13.4054 16.4807 13.6551L14.7821 15.3544C14.6168 15.5208 14.3836 15.6009 14.1509 15.571C13.3096 15.464 11.2098 14.9899 9.1099 12.89Z" fill="#0D4C93" />
                                            <path d="M17.4483 11.7585C17.0293 11.7585 16.6897 11.4188 16.6897 10.9999C16.6861 7.85903 14.1409 5.31376 11 5.31021C10.581 5.31021 10.2414 4.97056 10.2414 4.55159C10.2414 4.13261 10.581 3.79297 11 3.79297C14.9785 3.79736 18.2025 7.02142 18.2069 10.9999C18.2069 11.4188 17.8673 11.7585 17.4483 11.7585Z" fill="#0D4C93" />
                                            <path d="M21.2414 11.7586C20.8224 11.7586 20.4828 11.419 20.4828 11C20.4769 5.76524 16.2348 1.52309 11 1.51724C10.581 1.51724 10.2414 1.1776 10.2414 0.758621C10.2414 0.339646 10.581 0 11 0C17.0724 0.00668947 21.9933 4.92764 22 11C22 11.2012 21.9201 11.3942 21.7778 11.5364C21.6356 11.6787 21.4426 11.7586 21.2414 11.7586Z" fill="#0D4C93" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_502_301">
                                                <rect width="22" height="22" fill="white" />
                                            </clipPath>
                                        </defs>
                                    </svg>
                                </div>
                                <div className='footer-contact-text'>
                                    <p>+998 71 276-62-53 <br />+998 71 276-62-54</p>
                                </div>
                            </div>
                            <div className='footer-gmail'>
                                <div className="gmail-icon icon">
                                    <svg xmlns="http://www.w3.org/2000/svg" width="23" height="23" viewBox="0 0 23 23" fill="none">
                                        <g clip-path="url(#clip0_502_285)">
                                            <path d="M20.9785 2.74023H2.02149C1.71031 2.74023 1.41899 2.81674 1.15544 2.94283L11.4551 13.2425L13.7636 11.0239C13.7636 11.0239 13.7637 11.0237 13.7638 11.0236C13.7638 11.0235 13.764 11.0234 13.764 11.0234L21.8449 2.94301C21.5813 2.81683 21.2898 2.74023 20.9785 2.74023Z" fill="#0D4C93" />
                                            <path d="M22.7977 3.896L15.1932 11.5001L22.7974 19.1043C22.9235 18.8408 23 18.5495 23 18.2383V4.76173C23 4.45074 22.9237 4.15946 22.7977 3.896Z" fill="#0D4C93" />
                                            <path d="M0.202598 3.89551C0.076502 4.15906 0 4.45038 0 4.76156V18.2381C0 18.5491 0.0764121 18.8405 0.202418 19.1039L7.80693 11.4998L0.202598 3.89551Z" fill="#0D4C93" />
                                            <path d="M14.2403 12.4532L11.9315 14.672C11.7999 14.8037 11.6275 14.8695 11.4551 14.8695C11.2828 14.8695 11.1103 14.8037 10.9787 14.672L8.75977 12.4531L1.15512 20.0573C1.41873 20.1835 1.71022 20.2601 2.02149 20.2601H20.9785C21.2897 20.2601 21.581 20.1836 21.8446 20.0575L14.2403 12.4532Z" fill="#0D4C93" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_502_285">
                                                <rect width="23" height="23" fill="white" />
                                            </clipPath>
                                        </defs>
                                    </svg>
                                </div>
                                <div className="gmail-text">
                                    <p>info@medol.uz </p>
                                </div>
                            </div>
                            <Button title='Оставить заявку' />
                        </div>
                        <div className='footer-logo'>
                            <img src={Logo} alt="" />
                            <p>
                                Наша цель – построить прозрачный, <br /> долгосрочный
                                бизнес, приносить огромную <br />пользу
                                населению, путем решения глобальных <br /> вопросов.
                                Внедряя инновационные технологии <br /> на рынок Узбекистана.
                            </p>
                        </div>
                    </div>
                    <div className='footer-title footer-item'>
                        <div>
                            <h1> О компании
                            </h1>
                            <p>История <br />
                                Партнеры <br />
                                Вакансии</p>
                        </div>
                        <div>
                            <h1>Продукция
                            </h1>
                            <p>Эндоваскулярная хирургия <br />
                                Аритмология <br />
                                Кардиохирургия <br />
                                Лабораторная диагностика <br />
                                Хирургия <br />
                                Эндоурология <br />
                                Нейрохирургия <br />
                                Анестезиология и реанимация <br />
                                Диабет</p>
                        </div>
                        <div>
                            <h1>Услуги
                            </h1>
                            <p>Сервис <br />
                                Регистрации <br />
                                Услуги логистики
                                </p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}
